# Задача №5. Решение в группах
# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.3
# Input: 3 4(ввод на разных строках)
# Output: 6

a=int(input("Номер по порядку вагона - "))
b=int(input("Номер вагона - "))
if a==b:
    print('Выйди с Вагона и посчитай пожалуйста')
else:
    print("в этом поезде", (a+b-1) , "вогонов")


